<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>
        <v-sheet class="pa-4">
          <h1>Практические задания</h1>
          <hr class="my-3" />

          <h3 class="mb-4">1. Markdown editor</h3>
          <p>
            Напишите программу - markdown editor. Программа должна представлять
            из себя страницу, на которой будет текстовый редактор, в котором
            будет реализована возможность использовать разметку. А также будет
            экран, на котором будет отображаться преобразованный текст.
          </p>
          <p>
            Например, выражение вида <code># Title</code> будет преобразовано в
            <code>h1</code>, а выражение <code>** text **</code> сделает текст
            жирным. И так далее.
          </p>
          <p>
            Реализуйте на выбор 10 самых основных элементов markdown синтаксиса.
          </p>
          <div class="d-flex justify-center">
            <v-img max-width="600" :src="image1" />
          </div>

          <h3 class="mb-4 mt-12">2. Таблица с сортировков и фильтрацией</h3>
          <p>
            Напишите программу, которая будет являться страницей с небольшой
            таблицей. Должны быть предусмотрены CRUD операции - добавление новых
            элементов, редактирование и удаление.
          </p>
          <p>
            Также таблица должна уметь сортировать элементы по значениям
            соответствующих столбцов по клику на них.
          </p>
          <p>
            Дополнительно предусмотрите возможность фильтрации выводимых строк
            таблицы по поисковому запросу. Он может вводиться, например, через
            текстовое поле.
          </p>
          <div class="d-flex justify-center">
            <v-img max-width="500" :src="image2" />
          </div>

          <h3 class="mb-4 mt-12">3. Древовидный список</h3>
          <p>
            Напишите программу, являющуюся страницей с рекурсивным деревом
            отображаемых значений. Дерево представляет собой структуру наподобие
            папок и файлов.
          </p>
          <p>
            При нажатии на элемент он раскрывается, отображая все содержащиеся
            внутри него элементы (может быть что угодно). Также в каждой
            подпапке есть возможность добавить новый элемент, а при двойном
            клике на элемент он становится новой папкой, которую можно также
            открыть и добавлять в неё новые элементы. И так далее.
          </p>
          <p>
            При закрытии / раскрытии определённого элемента его структура должна
            сохраниться.
          </p>
          <div class="d-flex justify-center">
            <v-img max-width="600" :src="image3" />
          </div>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import image1 from '~/assets/images/ex1.png';
import image2 from '~/assets/images/ex2.png';
import image3 from '~/assets/images/ex3.png';

export default {
  name: "PracticePage",
  data() {
    return {
      image1,
      image2,
      image3
    }
  }
};
</script>
