<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>
        <v-sheet class="pa-4">
          <h1>Итого</h1>
          <hr class="my-3" />

          <div class="mt-6">
            <p>Есть четыре основных способа добавления Vue.js в проект:</p>
            <ol class="mb-4">
              <li>Импорт CDN пакета на странице</li>
              <li>Скачивание файлов JavaScript и их самостоятельный хостинг</li>
              <li>Установка с использованием npm</li>
              <li>Использование официального CLI для развёртывания проекта.</li>
            </ol>
            <p>
              Vue — прогрессивный фреймворк для создания пользовательских
              интерфейсов. Его ядро упрощает интеграцию с другими библиотеками и
              существующими проектами. Vue полностью подходит и для разработки
              сложных одностраничных приложений.
            </p>
            <p>
              Для создания нового экземпляра приложения используют функцию
              <code>createApp</code> и метод <code>mount</code>
            </p>
            <p>
              У каждого компонента есть свойства <code>data</code>,
              <code>methods</code>, <code>props</code>, <code>computed</code>,
              <code>inject</code> и <code>setup</code>.
            </p>
            <p>
              Через экземпляр компонента Vue есть доступ ко встроенным свойствам
              <code>$attrs</code> и <code>$emit</code>.
            </p>
            <p>
              Между шагами инициализации компонента вызываются функции,
              называемые хуками жизненного цикла, предоставляющие возможность
              выполнять код на определённых этапах. К таким хукам относятся
              <code>created</code>, <code>mounted</code>, <code>updated</code> и
              <code>unmounted</code>.
            </p>
            <p>
              Vue.js использует синтаксис шаблонов, основанный на HTML. Он
              позволяет декларативно связывать отрисованный DOM с данными
              экземпляра компонента.
            </p>
            <p>
              Данные можно связывать с помощью текстовой интерполяции с
              использованием «Mustache»-синтаксиса из двойных фигурных скобок
              <code v-pre>{{ text }}</code
              >. Для вывода в виде HTML необходимо использовать директиву
              <code>v-html</code>.
            </p>
            <p>
              Внутри HTML-атрибутов следует использовать директиву
              <code>v-bind</code>. Также Vue поддерживает всю мощь выражений
              JavaScript внутри привязки к данным.
            </p>
            <p>
              Директивы — специальные атрибуты с префиксом <code>v-</code>,
              которые применяют реактивное изменение в DOM, когда изменится
              значение выражения.
            </p>
            <p>
              В директивах можно использовать динамические аргументы в виде
              выражений JavaScript.
            </p>
            <p>
              Модификаторы — специальные постфиксы, которые обозначают, что
              директива должна быть привязана каким-то особенным образом.
            </p>
            <p>
              В компоненте свойство <code>data</code> должно быть функцией. Vue
              вызывает эту функцию на этапе создания нового экземпляра
              компонента. Она должна вернуть объект, который затем Vue обернёт в
              свою систему реактивности и сохранит в экземпляре компонента как
              <code>$data</code>.
            </p>
            <p>
              Для добавления методов в экземпляр компонента используется опция
              <code>methods</code>. Значением должен быть объект, который будет
              содержать все необходимые методы.
            </p>
            <p>
              Методы, вызываемые из шаблона, не должны иметь побочных эффектов.
            </p>
            <p>
              Для сложной логики, включающей реактивные данные, следует
              использовать вычисляемые свойства. Vue будет обновлять все
              привязки при изменениях зависимостей.
            </p>
            <p>
              Vue предоставляет способ реагировать на изменения данных с помощью
              опции <code>watch</code>. Это полезно, если необходимо выполнять
              асинхронные или затратные операции в ответ на изменение данных.
            </p>
            <p>
              Когда есть данные, которые нужно изменять на основе других данных,
              уместнее использовать вычисляемые свойства.
            </p>
            <p>
              Для динамической установки или удаления CSS-классов в директиву
              <code>:class</code> можно передавать объект. Можно передать массив
              в <code>:class</code>, чтобы применить список классов
            </p>
            <p>
              Для отрисовки блока по условию используется директива
              <code>v-if</code>. Блок будет отображаться только в случае, если
              выражение директивы возвращает <code>true</code>. Для указания
              блока «иначе» можно использовать директиву <code>v-else</code>.
              <code>v-else-if</code> служит в качестве блока «else if».
            </p>
            <p>
              Ещё одним вариантом условного отображения является директива
              <code>v-show</code>. Элемент с <code>v-show</code> будет всегда
              отрисовываться и оставаться в DOM, а переключаться будет лишь его
              CSS свойство <code>display</code>.
            </p>
            <p>
              Используйте директиву <code>v-for</code> для отрисовки списка
              элементов на основе массива данных. <code>item in items</code>.
              Можно использовать и для итерирования по свойствам объекта. Можно
              указать второй аргумент для получения ключа объекта.
            </p>
            <p>
              При обновлении списка элементов, если порядок изменился, Vue
              обновит каждый элемент «на месте». Чтобы подсказать Vue, как
              определять идентичность каждого элемента, необходимо указать
              атрибут <code>key</code> для каждого элемента.
            </p>
            <p>
              Не рекомендуется использовать вместе <code>v-if</code> и
              <code>v-for</code>.
            </p>
            <p>
              Можно использовать директиву <code>v-on</code>, чтобы прослушивать
              события DOM и запускать JavaScript-код по их наступлению. Можно
              задать несколько методов, разделив их запятой.
            </p>
            <p>
              Иногда может потребоваться доступ к оригинальному событию DOM в
              inline-обработчиках. В этом случае его можно передать в метод,
              используя специальную переменную <code>$event</code>:
            </p>
            <p>
              Существует несколько модификаторов событий для
              <code>v-on</code>:
            </p>
            <ul class="mb-4">
              <li><code>.stop</code></li>
              <li><code>.prevent</code></li>
              <li><code>.capture</code></li>
              <li><code>.self</code></li>
              <li><code>.once</code></li>
              <li><code>.passive</code></li>
            </ul>
            <p>
              Директива <code>v-model</code> используется для создания
              двусторонней привязки данных с элементами форм: input, textarea и
              select.
            </p>
            <p>
              Компоненты — переиспользуемые экземпляры со своим именем. Их можно
              использовать как пользовательские теги в корневом экземпляре. У
              них могут быть те же опции что и у корневого экземпляра:
              <code>data</code>, <code>computed</code>, <code>watch</code>,
              <code>methods</code>, хуки жизненного цикла.
            </p>
            <p>
              Входные параметры — пользовательские атрибуты, которые указываются
              на компоненте. Чтобы передавать свойства в компоненты, нужно
              определять их в списке входных параметров, которые принимает
              компонент, с помощью опции <code>props</code>. При передаче
              значения в атрибут входного параметра, оно станет свойством
              данного экземпляра. Значение этого свойства доступно в шаблоне,
              как и любое другое свойство компонента. После объявления входного
              параметра можно передавать данные в него через пользовательский
              атрибут.
            </p>
            <p>
              Экземпляры компонента предоставляют собственную систему событий.
              Родительский компонент может прослушивать любые события на
              экземпляре дочернего компонента с помощью <code>v-on</code> или
              <code>@</code>.
            </p>
            <p>
              Чтобы сгенерировать событие, дочерний компонент может
              воспользоваться встроенным методом <code>$emit</code>, передавая в
              него аргументом имя события. Для передачи значения можно
              использовать второй параметр.
            </p>
            <p>
              Чтобы динамически переключаться между компонентами, как например в
              интерфейсе с вкладками, нужно использовать элемент
              <code>&lt;component></code> со специальным атрибутом
              <code>is</code>
            </p>
          </div>

          <v-btn
            class="mt-6"
            color="success"
            nuxt
            to="/guide/[2.1] registration"
          >
            Дальше
          </v-btn>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import SuccessAlert from "~/components/SuccessAlert.vue";
import InfoAlert from "~/components/InfoAlert";
import WarningAlert from "~/components/WarningAlert";

export default {
  name: "GuideFirstSummary",
  components: { SuccessAlert, InfoAlert, WarningAlert },
};
</script>
