<template>
  <v-row justify="center" align="center">
    <v-col cols="12">
      <v-card>
        <v-sheet class="pa-4">
          <h1>Итого</h1>
          <hr class="my-3" />

          <div class="mt-6">
            <p>
              При описании компонентов в строковых шаблонах или однофайловых
              компонентах есть два способа их именования. В стиле kebab-case и
              PascalCase. При kebab-case, также нужно использовать kebab-case и
              при обращении к пользовательскому элементу. При PascalCase можно
              использовать любой стиль именования.
            </p>
            <p>Компоненты можно регистрировать глобально и локально.</p>
            <p>
              Можно передать все свойства объекта в качестве входных параметров
              с помощью <code>v-bind</code> без аргументов.
            </p>
            <p>
              Все входные параметры образуют одностороннюю привязку между
              дочерним свойством и родительским. Каждый раз, когда обновляется
              родительский компонент, все входные параметры дочернего компонента
              будут обновлены актуальными значениями.
            </p>
            <p>
              Компоненты могут указывать требования к своим входным параметрам.
              Если эти требования не выполнены — Vue предупредит сообщением в
              JavaScript-консоли браузера. Чтобы указать валидации входного
              параметра, можно предоставить в
              <code>props</code> объект с валидациями для проверки значения,
              вместо массива строк.
            </p>
            <p>
              Обычный атрибут для компонента — атрибут или слушатель события,
              который передаётся в компонент, но не имеет соответствующего
              свойства указанного в <code>props</code> или <code>emits</code>.
              Например, <code>class</code>, <code>style</code> и
              <code>id</code>.
            </p>
            <p>
              Если в компоненте один корневой элемент, то обычные атрибуты будут
              добавляться к этому элементу автоматически. Это можно отключить с
              помощью <code>inheritAttrs: false</code>.
            </p>
            <p>
              Для компонентов с несколькими корневыми элементами не будет
              автоматического наследования атрибутов.
            </p>
            <p></p>
            <p></p>
            <p></p>
          </div>

          <v-btn class="mt-6" color="success" nuxt to="/testing">
            Дальше
          </v-btn>
        </v-sheet>
      </v-card>
    </v-col>
  </v-row>
</template>

<script>
import SuccessAlert from "~/components/SuccessAlert.vue";
import InfoAlert from "~/components/InfoAlert";
import WarningAlert from "~/components/WarningAlert";

export default {
  name: "GuideSecondSummary",
  components: { SuccessAlert, InfoAlert, WarningAlert },
};
</script>
